deploy/jmeter/ipie-interservice-bulkhead-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!-- Fires ONLY the cross-service call, to find InterServiceClient's ceiling.
     Run prepare-registrations.py first; see README.md. -->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="iPIE inter-service bulkhead test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Complete registrations" enabled="true">
        <!-- Ramp-up of 1s with every thread doing a single request: the point is to have as many
             calls in flight at the same instant as possible, since the Bulkhead limits CONCURRENT
             calls, not throughput. A gentle ramp would let each call finish before the next starts
             and the limit would never be approached however many requests were sent. -->
        <stringProp name="ThreadGroup.num_threads">${__P(threads,50)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,1)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(loops,1)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </ThreadGroup>
      <hashTree>

        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- One registration id per thread. A registration can only be completed once (a second
             attempt is refused as already-completed), so rows are never recycled and a thread that
             runs out stops rather than re-using one and measuring the refusal instead. -->
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Prepared registration ids" enabled="true">
          <stringProp name="filename">${__P(idsFile,ready.csv)}</stringProp>
          <stringProp name="variableNames">regId</stringProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">false</boolProp>
          <boolProp name="stopThread">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
        </CSVDataSet>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Complete registration (user-service -> iam-service)" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(appHost,ipie-user-service)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(appPort,8080)}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/registrations/${regId}/complete</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"fullName":"Bulkhead Probe","password":"Bulkhead@12345","category":"INDIAN"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>

      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>